Autodesk.Revit.DB.ElementMulticlassFilter.#ctor(System.Collections.Generic.IList{System.Type},System.Boolean)
Constructs a new instance of a filter to find elements whose Element subclasses matches any of a given set of input classes, with an option to instead match
elements whose Element subclass does not match the list of input classes.
typeList:
The list of Element subclass types to match.
inverted:
True if the filter should match all elements which are not of the given Element subclass.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more input types are not valid subclasses of Element for this filter.
-or-
One or more of the types do not exist in Revit's native object model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.ElementMulticlassFilter.#ctor(System.Collections.Generic.IList{System.Type})
Constructs a new instance of a filter to find elements whose Element subclasses matches any of a given set of input classes.
typeList:
The list of Element subclass types to match.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more input types are not valid subclasses of Element for this filter.
-or-
One or more of the types do not exist in Revit's native object model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012